// generic або узагальнений тип - спеціальний тип даних, що дозволяє створювати компоненти не прив'язуючись
// до конкретного типу даних, а вказувати цей тип даних під час створення компонента.

// На рядку 9 створена функція-generic ця функція приймає один параметр типу T та повертає значення типу Т.
// T - type variable, спеціальний тип змінних, який використовується в узагальнених типах для того, щоб зберігати тип замість значення.

// Type variable буде зберігати тип даних, який надасть користувач функції під час її виклику.

function myFuncOne<T>(value: T): T {
  return value;
}

// функція myFunc приймає та повертає рядок. Тип даних вказано явно у кутових дужках
const value1 = myFuncOne<string>('test');

// функція приймає та повертає число. У цьому випадку використовується type argument inference
// компілятор самостійно визначать який тип потрібно використовувати
const value2 = myFuncOne<number>(10);

// generic має значн перевагу над any в плані типізації
function myFuncTwo(value: any): any {
  return value;
}

const value3 = myFuncTwo('test');
const value4 = myFuncTwo(10);
